9/data/attachments/7d24c74df4b9e952.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7dee3b1c-3d37-4833-a528-95acda82439a</nif:username>
            <nif:friendToBeAdded>Edward_far_Friend_15488_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>